# SQL and SQLite

SQL ( Structure Query Language ) is a standard language for managining and manipuylating relation databases.

SQLite is a self-containes serverless and zero configuration database engine which is widely used for embedded database systems.

In this notebook , we are creating , tables, databases and performing Various Sql operations .

In [14]:
import sqlite3

In [15]:
# Connect to an Sqlie database
connection=sqlite3.connect('example.db')
connection

In [16]:
cursor=connection.cursor()

In [17]:
# Create a Table
cursor.execute('''
Create Table If Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )
''')

# Commit the changes
connection.commit()

In [18]:
cursor.execute('''
Select * from employees
''')

In [19]:
# Insert the data in sqlite table 
cursor.execute('''
Insert into employees(name,age,department)
        values("Kaustubh",22,'Data Scientist')
''')


cursor.execute('''
Insert into employees(name,age,department)
        values("Omkar",25,'Scientist')
''')


cursor.execute('''
Insert into employees(name,age,department)
        values("Adi",20,'Data')
''')

cursor.execute('''
Insert into employees(name,age,department)
        values("Om",22,'Data Engineer')
''')

cursor.execute('''
Insert into employees(name,age,department)
        values("Suyash",23,'Data S')
''')

## Connection . commit
connection.commit() # Commiti the changes

In [20]:
# Querying any data from sqlite3 
cursor.execute('Select * from employees')
rows=cursor.fetchall()
# print the queried data 
for row in rows:
    print(row)

(1, 'Kaustubh', 22, 'Data Scientist')
(2, 'Kaustubh', 22, 'Data Scientist')
(3, 'Omkar', 25, 'Scientist')
(4, 'Adi', 20, 'Data')
(5, 'Om', 22, 'Data Engineer')
(6, 'Suyash', 23, 'Data S')
(7, 'Kaustubh', 22, 'Data Scientist')
(8, 'Omkar', 25, 'Scientist')
(9, 'Adi', 20, 'Data')
(10, 'Om', 22, 'Data Engineer')
(11, 'Suyash', 23, 'Data S')
(12, 'Kaustubh', 22, 'Data Scientist')
(13, 'Omkar', 25, 'Scientist')
(14, 'Adi', 20, 'Data')
(15, 'Om', 22, 'Data Engineer')
(16, 'Suyash', 23, 'Data S')

In [23]:
cursor.execute('''
Update employees
Set age=23
Where name="Kaustubh"
''')
connection.commit()

In [ ]:
cursor.execute('Select * from employees')
rows=cursor.fetchall()
# print the queried data 
for row in rows:
    print(row)

(1, 'Kaustubh', 23, 'Data Scientist')
(2, 'Kaustubh', 23, 'Data Scientist')
(3, 'Omkar', 25, 'Scientist')
(4, 'Adi', 20, 'Data')
(5, 'Om', 22, 'Data Engineer')
(6, 'Suyash', 23, 'Data S')
(7, 'Kaustubh', 23, 'Data Scientist')
(8, 'Omkar', 25, 'Scientist')
(9, 'Adi', 20, 'Data')
(10, 'Om', 22, 'Data Engineer')
(11, 'Suyash', 23, 'Data S')
(12, 'Kaustubh', 23, 'Data Scientist')
(13, 'Omkar', 25, 'Scientist')
(14, 'Adi', 20, 'Data')
(15, 'Om', 22, 'Data Engineer')
(16, 'Suyash', 23, 'Data S')

In [26]:
cursor.execute('''
Delete From Employees
where name='Adi'
''')

connection.commit()

In [27]:
cursor.execute('Select * from employees')
rows=cursor.fetchall()
# print the queried data 
for row in rows:
    print(row)

(1, 'Kaustubh', 23, 'Data Scientist')
(2, 'Kaustubh', 23, 'Data Scientist')
(3, 'Omkar', 25, 'Scientist')
(5, 'Om', 22, 'Data Engineer')
(6, 'Suyash', 23, 'Data S')
(7, 'Kaustubh', 23, 'Data Scientist')
(8, 'Omkar', 25, 'Scientist')
(10, 'Om', 22, 'Data Engineer')
(11, 'Suyash', 23, 'Data S')
(12, 'Kaustubh', 23, 'Data Scientist')
(13, 'Omkar', 25, 'Scientist')
(15, 'Om', 22, 'Data Engineer')
(16, 'Suyash', 23, 'Data S')

## Working with Sales Data

In [31]:
# Connection to an Sqlite database 
connect=sqlite3.connect('sales_data.db')
cursor=connect.cursor()

# Create Table for Sales Data 
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
               id INTEGER PRIMARY KEY,
               date TEXT NOT NULL,
               product TEXT NOT NULL,
               sales INTEGER,
               region TEXT
               )

''')


# Insert data into sales table

sales_data=[
    ('2023-01-01','Product1',100,'North'),
    ('2023-01-02','Product1',200,'South'),
    ('2023-01-03','Product1',150,'East'),
    ('2023-01-04','Product1',250,'West'),
    ('2023-01-05','Product1',300,'North')

]

cursor.executemany(''' 
Insert into sales(date,product,sales,region)
                   values(?,?,?,?)


''',sales_data)

# Commit
connection.commit()

In [35]:
cursor.execute('Select * From sales')
rows=cursor.fetchall()

## Print all the rows
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product1', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product1', 250, 'West')
(5, '2023-01-05', 'Product1', 300, 'North')

In [36]:
# Permanenly close connectiom
connection.close()